AcRxValue.serializeIn(System.Void!System.Runtime.CompilerServices.IsConst*,System.UInt64)
The function can be used to serialize the AcRxValue in from a byte
array.  The function delegates to the IAcRxNonBlittableType interface
if the underlying type is not blittable.
pBytes:
A pointer to the array of bytes to serialize the value from.
maxBytesToRead:
The maximum number of bytest to read from pBytes. May be zero if the
size of the buffer is unknown.
Returns:
Returns the number of bytes serialized in.

AcRxValue.serializeOut(System.Void*,System.UInt64*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
The function can be used to serialize the AcRxValue out to a byte
array.  The function delegates to the IAcRxNonBlittableType interface
if the underlying type is not blittable.
pByteArray:
Returned pointer to buffer allocated by the function containing the serialized
bytes of the value.
maxBytesToWrite:
Input size of the pBytes array. On failure the function returns the number of
bytes needed in this parameter.
Returns:
Returns the number of bytes serialized out. The caller is responsible
allocating the input array large enough to hold the value, and passing
the size of the allocated array to this method. On error the method
returns 0 and sets maxBytesToWrite to the size of the buffer required to
hold the value.

AcRxValue.getEnumTag
The function can be used to obtain the AcRxEnumTag from this value. The
The value type must be an enum.
Returns:  Returns pointer to the AcRxEnumTag object if successful, returns NULL on error.

AcRxValue.unbox(AcRxObject*)
The function can be used to get the AcRxValue from AcRxBoxedValue object.
Returns:  Returns pointer to AcRxValue object if successful; otherwise it returns NULL

AcRxValue.unbox(AcRxObject!System.Runtime.CompilerServices.IsConst*)
The function can be used to get the AcRxValue from AcRxBoxedValue object.
Returns:  Returns pointer to AcRxValue object if successful; otherwise it returns NULL

AcRxValue.op_Equality(AcRxValue!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Compares the value for equality with another AcRxValue.
value:
Input reference to an AcRxValue.
Returns:
Returns true if the values are same; otherwise, returns false.

AcRxValue.toString(System.Char*,System.UInt64,AcRxValueType.StringFormat)
This method can be used to obtain the string representation of the value.
buffer:
Output pointer to the buffer that receives the text.
sizeInACHARs:
Input maximum number of characters to copy to the buffer, including the NULL character.
format:
This information is used while formatting the text, if the string needs to be formatted
depending on the current locale.
Returns:
Returns the number of characters that was written.

AcRxValue.varies
Returns a value that has the type set to varies.
Returns:
Returns const reference to an AcRxValue object that has the type set to varies.

AcRxValue.isVaries
Returns true if the value is varying.
Returns:
Returns true if the value is varying; otherwise, returns false.

AcRxValue.empty
Returns a value that is empty.
Returns:
Returns const reference to an AcRxValue object that is empty.

AcRxValue.isEmpty
Returns true if the current value is empty.
Returns:
Returns true if the current value is empty; otherwise, returns false.

AcRxValue.type
Returns the type of the value.
Returns:
Returns the type of the AcRxValue object.

AcRxValue.Dispose
Destructor
If the type is non-blittable then destructor of the type is called.

AcRxValue.op_Assign(AcRxValue!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Assignment operator. Copies all the data from the input AcRxValue
object to this object.
rhs:
Input source AcRxValue object.
Returns:
Returns const reference to this AcRxValue object.

AcRxValue.#ctor(AcRxValueType!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,AcRxValue!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
The object can be constructed using the type and value.
For example, we can use this to create an enumerated type from an integer.
type:
The type of the object.
value:
Input value of the object.

AcRxValue.#ctor(AcRxValue!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Copy constructor. Instantiates an object initialized to the same content as the input object.
rhs:
Another AcRxValue object.

AcRxValue.#ctor
Default constructor, the value type is empty.

AcRxValue
This is a variant type, an instance of this class can hold any
AcRxValueType.